constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          120;
        startFace       4320;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          120;
        startFace       4440;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       4560;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       4580;
    }
    airsurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       4600;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5280;
        startFace       4800;
    }
)

// ************************************************************************* //
