system/blockMeshDict
FoamFile 
{ 
	version 2.0; 
	format ascii; 
	class dictionary; 
	object blockMeshDict; 
} 

scale 1;

vertices 
( 
	// 1 block 
	(1.000000 -3.000000 0.000000)
	(4.000000 -3.000000 0.000000)
	(4.000000 0.000000 0.000000)
	(1.000000 0.000000 0.000000)
	(1.000000 -3.000000 1.000000)
	(4.000000 -3.000000 1.000000)
	(4.000000 0.000000 1.000000)
	(1.000000 0.000000 1.000000)
	// 2 block 
	(1.000000 0.000000 0.000000)
	(4.000000 0.000000 0.000000)
	(4.000000 3.000000 0.000000)
	(1.000000 3.000000 0.000000)
	(1.000000 0.000000 1.000000)
	(4.000000 0.000000 1.000000)
	(4.000000 3.000000 1.000000)
	(1.000000 3.000000 1.000000)
	// 3 block 
	(0.975752 0.005092 0.000000)
	(1.000000 -0.000000 0.000000)
	(1.000000 3.000000 0.000000)
	(0.975752 3.000000 0.000000)
	(0.975752 0.005092 1.000000)
	(1.000000 0.000000 1.000000)
	(1.000000 3.000000 1.000000)
	(0.975752 3.000000 1.000000)
	// 4 block 
	(0.905240 0.018910 0.000000)
	(0.975752 0.005092 0.000000)
	(0.975752 3.000000 0.000000)
	(0.905240 3.000000 0.000000)
	(0.905240 0.018910 1.000000)
	(0.975752 0.005092 1.000000)
	(0.975752 3.000000 1.000000)
	(0.905240 3.000000 1.000000)
	// 5 block 
	(0.795047 0.037760 0.000000)
	(0.905240 0.018910 0.000000)
	(0.905240 3.000000 0.000000)
	(0.795047 3.000000 0.000000)
	(0.795047 0.037760 1.000000)
	(0.905240 0.018910 1.000000)
	(0.905240 3.000000 1.000000)
	(0.795047 3.000000 1.000000)
	// 6 block 
	(0.655659 0.057071 0.000000)
	(0.795047 0.037760 0.000000)
	(0.795047 3.000000 0.000000)
	(0.655659 3.000000 0.000000)
	(0.655659 0.057071 1.000000)
	(0.795047 0.037760 1.000000)
	(0.795047 3.000000 1.000000)
	(0.655659 3.000000 1.000000)
	// 7 block 
	(0.500587 0.072303 0.000000)
	(0.655659 0.057071 0.000000)
	(0.655659 3.000000 0.000000)
	(0.500587 3.000000 0.000000)
	(0.500587 0.072303 1.000000)
	(0.655659 0.057071 1.000000)
	(0.655659 3.000000 1.000000)
	(0.500587 3.000000 1.000000)
	// 8 block 
	(0.344680 0.079180 0.000000)
	(0.500587 0.072303 0.000000)
	(0.500587 3.000000 0.000000)
	(0.344680 3.000000 0.000000)
	(0.344680 0.079180 1.000000)
	(0.500587 0.072303 1.000000)
	(0.500587 3.000000 1.000000)
	(0.344680 3.000000 1.000000)
	// 9 block 
	(0.203313 0.072945 0.000000)
	(0.344680 0.079180 0.000000)
	(0.344680 3.000000 0.000000)
	(0.203313 3.000000 0.000000)
	(0.203313 0.072945 1.000000)
	(0.344680 0.079180 1.000000)
	(0.344680 3.000000 1.000000)
	(0.203313 3.000000 1.000000)
	// 10 block 
	(0.091996 0.054325 0.000000)
	(0.203313 0.072945 0.000000)
	(0.203313 3.000000 0.000000)
	(0.091996 3.000000 0.000000)
	(0.091996 0.054325 1.000000)
	(0.203313 0.072945 1.000000)
	(0.203313 3.000000 1.000000)
	(0.091996 3.000000 1.000000)
	// 11 block 
	(0.022051 0.028152 0.000000)
	(0.091996 0.054325 0.000000)
	(0.091996 3.000000 0.000000)
	(0.022051 3.000000 0.000000)
	(0.022051 0.028152 1.000000)
	(0.091996 0.054325 1.000000)
	(0.091996 3.000000 1.000000)
	(0.022051 3.000000 1.000000)
	// 12 block 
	(0.000000 0.000000 0.000000)
	(0.022051 0.028152 0.000000)
	(0.022051 3.000000 0.000000)
	(0.000000 3.000000 0.000000)
	(0.000000 0.000000 1.000000)
	(0.022051 0.028152 1.000000)
	(0.022051 3.000000 1.000000)
	(0.000000 3.000000 1.000000)
	// 13 block 
	(-3.000000 0.000000 0.000000)
	(0.000000 0.000000 0.000000)
	(0.000000 3.000000 0.000000)
	(-3.000000 3.000000 0.000000)
	(-3.000000 0.000000 1.000000)
	(0.000000 0.000000 1.000000)
	(0.000000 3.000000 1.000000)
	(-3.000000 3.000000 1.000000)
	// 14 block 
	(-3.000000 -3.000000 0.000000)
	(0.000000 -3.000000 0.000000)
	(0.000000 0.000000 0.000000)
	(-3.000000 0.000000 0.000000)
	(-3.000000 -3.000000 1.000000)
	(0.000000 -3.000000 1.000000)
	(0.000000 0.000000 1.000000)
	(-3.000000 0.000000 1.000000)
	// 15 block 
	(0.000000 -3.000000 0.000000)
	(0.026892 -3.000000 0.000000)
	(0.026892 -0.023408 0.000000)
	(0.000000 0.000000 0.000000)
	(0.000000 -3.000000 1.000000)
	(0.026892 -3.000000 1.000000)
	(0.026892 -0.023408 1.000000)
	(0.000000 0.000000 1.000000)
	// 16 block 
	(0.026892 -3.000000 0.000000)
	(0.098987 -3.000000 0.000000)
	(0.098987 -0.037507 0.000000)
	(0.026892 -0.023408 0.000000)
	(0.026892 -3.000000 1.000000)
	(0.098987 -3.000000 1.000000)
	(0.098987 -0.037507 1.000000)
	(0.026892 -0.023408 1.000000)
	// 17 block 
	(0.098987 -3.000000 0.000000)
	(0.208902 -3.000000 0.000000)
	(0.208902 -0.042343 0.000000)
	(0.098987 -0.037507 0.000000)
	(0.098987 -3.000000 1.000000)
	(0.208902 -3.000000 1.000000)
	(0.208902 -0.042343 1.000000)
	(0.098987 -0.037507 1.000000)
	// 18 block 
	(0.208902 -3.000000 0.000000)
	(0.346303 -3.000000 0.000000)
	(0.346303 -0.039923 0.000000)
	(0.208902 -0.042343 0.000000)
	(0.208902 -3.000000 1.000000)
	(0.346303 -3.000000 1.000000)
	(0.346303 -0.039923 1.000000)
	(0.208902 -0.042343 1.000000)
	// 19 block 
	(0.346303 -3.000000 0.000000)
	(0.499413 -3.000000 0.000000)
	(0.499413 -0.033414 0.000000)
	(0.346303 -0.039923 0.000000)
	(0.346303 -3.000000 1.000000)
	(0.499413 -3.000000 1.000000)
	(0.499413 -0.033414 1.000000)
	(0.346303 -0.039923 1.000000)
	// 20 block 
	(0.499413 -3.000000 0.000000)
	(0.653358 -3.000000 0.000000)
	(0.653358 -0.024269 0.000000)
	(0.499413 -0.033414 0.000000)
	(0.499413 -3.000000 1.000000)
	(0.653358 -3.000000 1.000000)
	(0.653358 -0.024269 1.000000)
	(0.499413 -0.033414 1.000000)
	// 21 block 
	(0.653358 -3.000000 0.000000)
	(0.792738 -3.000000 0.000000)
	(0.792738 -0.014999 0.000000)
	(0.653358 -0.024269 0.000000)
	(0.653358 -3.000000 1.000000)
	(0.792738 -3.000000 1.000000)
	(0.792738 -0.014999 1.000000)
	(0.653358 -0.024269 1.000000)
	// 22 block 
	(0.792738 -3.000000 0.000000)
	(0.903777 -3.000000 0.000000)
	(0.903777 -0.007191 0.000000)
	(0.792738 -0.014999 0.000000)
	(0.792738 -3.000000 1.000000)
	(0.903777 -3.000000 1.000000)
	(0.903777 -0.007191 1.000000)
	(0.792738 -0.014999 1.000000)
	// 23 block 
	(0.903777 -3.000000 0.000000)
	(0.975305 -3.000000 0.000000)
	(0.975305 -0.001896 0.000000)
	(0.903777 -0.007191 0.000000)
	(0.903777 -3.000000 1.000000)
	(0.975305 -3.000000 1.000000)
	(0.975305 -0.001896 1.000000)
	(0.903777 -0.007191 1.000000)
	// 24 block 
	(0.975305 -3.000000 0.000000)
	(1.000000 -3.000000 0.000000)
	(1.000000 0.000000 0.000000)
	(0.975305 -0.001896 0.000000)
	(0.975305 -3.000000 1.000000)
	(1.000000 -3.000000 1.000000)
	(1.000000 0.000000 1.000000)
	(0.975305 -0.001896 1.000000)
);

blocks 
( 
	// 1 hexBLOCK 
	hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 2 hexBLOCK 
	hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 3 hexBLOCK 
	hex (16 17 18 19 20 21 22 23) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 4 hexBLOCK 
	hex (24 25 26 27 28 29 30 31) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 5 hexBLOCK 
	hex (32 33 34 35 36 37 38 39) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 6 hexBLOCK 
	hex (40 41 42 43 44 45 46 47) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 7 hexBLOCK 
	hex (48 49 50 51 52 53 54 55) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 8 hexBLOCK 
	hex (56 57 58 59 60 61 62 63) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 9 hexBLOCK 
	hex (64 65 66 67 68 69 70 71) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 10 hexBLOCK 
	hex (72 73 74 75 76 77 78 79) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 11 hexBLOCK 
	hex (80 81 82 83 84 85 86 87) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 12 hexBLOCK 
	hex (88 89 90 91 92 93 94 95) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 13 hexBLOCK 
	hex (96 97 98 99 100 101 102 103) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 14 hexBLOCK 
	hex (104 105 106 107 108 109 110 111) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 15 hexBLOCK 
	hex (112 113 114 115 116 117 118 119) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 16 hexBLOCK 
	hex (120 121 122 123 124 125 126 127) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 17 hexBLOCK 
	hex (128 129 130 131 132 133 134 135) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 18 hexBLOCK 
	hex (136 137 138 139 140 141 142 143) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 19 hexBLOCK 
	hex (144 145 146 147 148 149 150 151) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 20 hexBLOCK 
	hex (152 153 154 155 156 157 158 159) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 21 hexBLOCK 
	hex (160 161 162 163 164 165 166 167) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 22 hexBLOCK 
	hex (168 169 170 171 172 173 174 175) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 23 hexBLOCK 
	hex (176 177 178 179 180 181 182 183) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
	// 24 hexBLOCK 
	hex (184 185 186 187 188 189 190 191) (10 10 1) simpleGrading (1.000000 1.000000 1.000000) 
);

edges 
( 

);

boundary
(
	bottom 
	{ 
		type empty; 
		faces 
		(
			// block 14 LOWER part
			(104 105 109 108)
			// block 15 LOWER part
			(112 113 117 116)
			// block 16 LOWER part
			(120 121 125 124)
			// block 17 LOWER part
			(128 129 133 132)
			// block 18 LOWER part
			(136 137 141 140)
			// block 19 LOWER part
			(144 145 149 148)
			// block 20 LOWER part
			(152 153 157 156)
			// block 21 LOWER part
			(160 161 165 164)
			// block 22 LOWER part
			(168 169 173 172)
			// block 23 LOWER part
			(176 177 181 180)
			// block 24 LOWER part
			(184 185 189 188)
			// block 1 LOWER part
			(0 1 5 4)
		); 
	}
	top 
	{ 
		type empty; 
		faces 
		(
			// block 2 UPPER part
			(11 10 14 15)
			// block 3 UPPER part
			(19 18 22 23)
			// block 4 UPPER part
			(27 26 30 31)
			// block 5 UPPER part
			(35 34 38 39)
			// block 6 UPPER part
			(43 42 46 47)
			// block 7 UPPER part
			(51 50 54 55)
			// block 8 UPPER part
			(59 58 62 63)
			// block 9 UPPER part
			(67 66 70 71)
			// block 10 UPPER part
			(75 74 78 79)
			// block 11 UPPER part
			(83 82 86 87)
			// block 12 UPPER part
			(91 90 94 95)
			// block 13 UPPER part
			(99 98 102 103)
		); 
	}
	inlet 
	{ 
		type wall; 
		faces 
		(
			// UPPER block
			(96 99 103 100)
			// LOWER block
			(104 107 111 108)
		); 
	}
	outlet 
	{ 
		type wall; 
		faces 
		(
			// UPPER block
			(9 13 14 10)
			// LOWER block
			(1 5 6 2)
		); 
	}
	airsurface 
	{ 
		type wall; 
		faces 
		(
			// block 3 airfoil' surface part
			(16 17 21 20)
			// block 4 airfoil' surface part
			(24 25 29 28)
			// block 5 airfoil' surface part
			(32 33 37 36)
			// block 6 airfoil' surface part
			(40 41 45 44)
			// block 7 airfoil' surface part
			(48 49 53 52)
			// block 8 airfoil' surface part
			(56 57 61 60)
			// block 9 airfoil' surface part
			(64 65 69 68)
			// block 10 airfoil' surface part
			(72 73 77 76)
			// block 11 airfoil' surface part
			(80 81 85 84)
			// block 12 airfoil' surface part
			(88 89 93 92)
			// block 15 LOWER part
			(115 114 118 119)
			// block 16 LOWER part
			(123 122 126 127)
			// block 17 LOWER part
			(131 130 134 135)
			// block 18 LOWER part
			(139 138 142 143)
			// block 19 LOWER part
			(147 146 150 151)
			// block 20 LOWER part
			(155 154 158 159)
			// block 21 LOWER part
			(163 162 166 167)
			// block 22 LOWER part
			(171 170 174 175)
			// block 23 LOWER part
			(179 178 182 183)
			// block 24 LOWER part
			(187 186 190 191)
		); 
	}
);

mergePatchPairs 
( 
);
